Rails/app/views/users/show.html.erb

SELECT COUNT(*) FROM "sleeps" WHERE "sleeps"."user_id" = ?  [["user_id", 2]]
---
			<div class="span8", id="sleeps-list">
				<% if @user.sleeps.any? %>

SELECT "sleeps".* FROM "sleeps" WHERE "sleeps"."user_id" = ? ORDER BY created_at desc LIMIT 7  [["user_id", 2]]
---
		<div class="row graphic_page section">
			<%= content_tag "div", id: "last7_chart", data: {content: @user.sleeps.limit(7).order('created_at desc')} do %>