Rails/app/controllers/users_controller.rb

	def show
        @user = User.find(params[:id])
        @sleeps = @user.sleeps.order('created_at desc')
        if @user.sleeps.any?
            @sleep_data = @user.sleeps.last.content.split(",").map(&:to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT 1 AS one FROM "sleeps" WHERE "sleeps"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT "sleeps".* FROM "sleeps" WHERE "sleeps"."user_id" = ? ORDER BY created_at desc LIMIT 7  [["user_id", 2]]